Repository: SuperVirus/wing7-po-all
Catalog: PO/*/build-files.po
Languages: es

source: Table of Contents
es: Tabla de Contenidos

source: Advanced indentation analysis and translation
es: Análisis avanzado de indentación y traducción

source: Recent menus
es: Menús recientes

source: Expression and value watching for debugger
es: Visor de expresiones y valores del depurador

source: Interactive debug probe tool
es: Herramienta interactiva para sondeo y depuración

source: Debug externally launched processes
es: Depurar procesos que han sido lanzados de manera externa

source: Module-oriented debug data view
es: Vista de depuración de datos orientada a módulos

source: Shared projects for use in revision control
es: Proyectos compartidos para ser usados junto con control de revisiones

source: Advanced breakpoints for debugger
es: Puntos de ruptura avanzados para el depurador

source: Debugger breakpoint manager
es: Administrador de puntos de ruptura del depurador

source: Source code browser
es: Navegador de código

source: Source assistant
es: Asistente de código

source: Keyboard and command macro support
es: Soporte de teclado y comandos macro

source: User-defined named bookmarks
es: Marcadores definidos por el usuario

source: Autocompletion
es: Autocompletado

source: Projects
es: Proyectos

source: Wildcard and regular expression search
es: Búsqueda mediante comodines y expresiones regulares

source: Batch search
es: Búsqueda por lotes

source: Disk search
es: Búsqueda en disco

source: Multi-window GUI support
es: Soporte para interfaz multi-ventana

source: Messages view
es: Vista de mensajes

source: Unit testing tool
es: Herramienta de pruebas unitarias

source: Support for running external processes in a console
es: Soporte para ejecutar procesos externos en una consola

source: Code snippets
es: Fragmentos de código

source: Version control
es: Control de versiones

source: Perspectives
es: Perspectivas

source: Code warnings
es: Avisos emitidos

source: Auto-editing
es: Edición -automática

source: Generic support specific to Wing 101
es: Soporte genérico específico para Wing 101

source: Generic support specific to Wing Personal
es: Soporte genérico específico para Wing Personal

source: Generic support specific to Wing Pro
es: Soporte genérico específico para Wing Pro
