Repository: SuperVirus/wing7-po-all
Catalog: PO/*/scripts_django.po
Languages: fr

source: A plugin that provides Django-specific functionality when a project looks like it contains Django files. Copyright (c) 2010, Wingware All rights reserved. Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
fr: Un plugin qui fourni des fonctionnalités spécifiques Django quand un projet semble contenir des fichiers Django. Copyright (c) 2010, Wingware Tous droits réservés. Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

source: Utility that determines contexts attribute for always-active commands so those commands don't show in the GUI when the plugin is inactive
fr: Utilitaire qui détermine les attibuts de contexte pour les commandes toujours-actives ainsi ces commandes ne sont pas affichées dans l'interface graphique utilisateur quand le plugin est inactif

source: The following actions were completed successfully:
fr: Les opérations suivantes ont été complétées avec succès :

source: , and
fr: , et

source: Some errors occurred. You may need to correct these manually:
fr: Des erreurs sont survenues. Vous pourriez devoir corriger celles-ci manuellement :

source: You may need to configure Python Executable in Project Properties
fr: Vous pourriez avoir besoin de configurer l’Exécutable Python dans les Propriétés du projet

source: Could not find django-admin.py
fr: N'a pas pu trouvé django-admin.py

source: Could not find django-admin.py on the path. Please specify the full path.
fr: N'a pas pu trouver django-admin.py dans le path. Veuillez spécifier le path complet.

source: Could not open %s -- please check the path
fr: N'a pas pu ouvrir %s -- veuillez vérifier le chemin

source: Could not determine Python to use
fr: N’a pu déterminer quel Python utiliser

source: Python Executable
fr: Exécutable Python

source: Cancel
fr: Annuler

source: Failed to Execute django-admin.py startproject
fr: Échec d’exécution de django-admin.py startproject

source: The command '%s' failed with error code %i and the following output: %s
fr: La commande '%s' a échouée avec le code d'erreur %i et la sortie suivante : %s

source: Wing may not be finding the right Python. Please edit django-admin.py to set the correct path for Python after #! on the first line.
fr: Wing ne trouve pas le bon Python. Veuillez éditet django-admin.py pour fixer le chemin correct pour Python après #! sur la première ligne.

source: Failed to Start Project
fr: Échec du démarrage du projet

source: The command '%s' failed to produce output: settings.py is missing.
fr: La commande '%s' n'a pas pu produire de sortie : settings.py est manquant.

source: site directory %s was created with django-admin.py startproject
fr: le répertoire de site %s a été créé avec django-admin.py startproject

source: Could not read %s to set default settings
fr: N'a pas pu lire %s pour fixer la configuration par défaut

source: Failed to write updated settings to %s
fr: Échec d'écriture des configurations mises à jour dans %s

source: database engine and name in settings.py were set to use sqlite3 by default
fr: le moteur et le nom de la base de données dans settings.py ont été définis pour utilliser sqlite3 par défaut

source: django.contrib.admin was added to INSTALLED_APPS in settings.py
fr: django.contrib.admin a été ajouté à INSTALLED_APPS dans settings.py

source: (superuser account %s was created)
fr: (le compte superuser %s a été créé)

source: The superuser account must be created manually. Copy/paste this command to a shell: %s
fr: Le compte superuser doit être créé manuellement. Copier/coller cette commande dans un shell : %s

source: The command %s failed with error code %i and output as follows: %s
fr: La commande %s a échouée avec le code d'erreur %i et la sortie était : %s

source: The command %s succeeded but printed unexpected output: %s
fr: La commande %s a réussi mais imprimé la sortie inattendue suivante : %s

source: The command %s exited with error code %i and no output
fr: La commande %s a quittée avec le code d'erreur %i et pas de sortie

source: django-admin.py %s was run%s
fr: django-admin.py %s était lancé %s

source: Could not execute %s to locate base_site.html: Err=%i; %s
fr: N'a pas pu exécuter %s pour localiser base_site.html : Err=%i ; %s

source: Could not copy base_site.html into the project
fr: N'a pas pu copier base_site.html dans le projet

source: the default admin template %s was copied into the project
fr: le modèle d'administrateur par défaut %s a été copié dans le projet

source: Created Django Project
fr: Projet Django créé

source: The Django project has been created.
fr: Le projet Django a été créé.

source: You can now set up a new Wing project if desired.
fr: Vous pouvez maintenant établir un nouveau projet Wing si souhaité.

source: Wing Project Setup Canceled
fr: Installation du projet Wing annulée

source: Setting up a Wing project for your newly created Django site was canceled. You can set one up manually later by creating a project, adding the Django site files, and choosing Configure Project for Django from the Django menu that will appear in the menu bar after the Django files have been added to the project.
fr: Établir un projet Wing pour votre site Django nouvellement créé a été annulé. Vous pouvez en établir un manuellement plus tard en créant un projet, ajoutant des fichiers de site Django, et choisissant Configurer un Projet pour Django depuis le menu Django qui apparaîtra dans la barre de menu après que les fichiers Django aient été ajoutés au projet.

source: Create Wing Project
fr: Créer un projet Wing

source: Start New Django Project
fr: Démarrer un nouveau projet Django

source: Which django-admin.py and Django installation to use for the new project. Use the default if the desired django-admin.py is on your PATH.
fr: Quel django-admin.py et installation Django à utiliser pour le nouveau projet. Utiliser par défaut si le django-admin.py désiré est sur votre PATH.

source: The parent directory into which the new project's site directory should be written.
fr: Le répertoire parent dans lequel le nouveau répertoire du site de projet doit être écrit.

source: The Django site name for the new project.
fr: Le nom de site Django pour le nouveau projet.

source: The superuser account name (blank to skip creating account)
fr: Le nom du compte superuser (vierge pour passer la création de compte)

source: The superuser account's email address (ignored when not creating account)
fr: L'adresse email du compte superuser (ignoré si pas de création de compte)

source: The superuser account password (ignored when not creating account)
fr: Le mot de passe du compte superuser (ignoré si pas de création de compte)

source: The full path to the Python Executable to use with Django
fr: Le chemin complet vers l’exécutable Python à utiliser avec Django

source: Django Files Not Found
fr: Fichiers Django non trouvés

source: Could not determine which Python Executable to use in Project Properties. Set this manually if the default Python is not the one being used with Django.
fr: N'a pas pu déterminer quel exécutable Python utiliser dans les propriétés du Projet. Définissez le manuellement si le Python par défaut n'est pas celui utilisé avec Django.

source: Could not obtain Python Executable to use in Project Properties from %s. Set this manually if the default Python is not the one being used with Django.
fr: N'a pas pu obtenir l'exécutable Python à utiliser dans les propriétés du Projet depuis %s. Définissez le manuellement si le Python par défaut n'est pas celui utilisé avec Django.

source: %s was set as the Python Executable in Project Properties
fr: %s a été défini comme l'exécutable Python dans les propriétés du projet

source: Launch Django
fr: Lancer Django

source: %s was set as main debug file with run arguments %s
fr: %s a été défini comme le fichier de débogage principal fonctionnant avec les arguments %s

source: enabled child process debugging in Project Properties (for auto-reload)
fr: activé le processus enfant débogage dans les propriétés du projet (pour auto-rechargement)

source: DJANGO_SITENAME and DJANGO_SETTINGS_MODULE environment variables were added to the project-wide environment
fr: les variables d'environnement DJANGO_SITENAME et DJANGO_SETTINGS_MODULE ont été ajoutées à l'ensemble de l'environnement de projet

source: added directories %s and %s to the Python Path in Project Properties
fr: les répertoires %s et %s ont été ajoutés au chemin Python dans les Propritétés du projet

source: Failed to write %s with TEMPLATE_DEBUG enabled
fr: Écriture de %s échouée avec TEMPLATE_DEBUG activé

source: set TEMPLATE_DEBUG = True in the site's settings.py file so Wing's debugger can debug templates
fr: Attribuer TEMPLATE_DEBUG = True dans le fichier de site settings.py ainsi le débogueur Wing pourra déboguer les modèles

source: enabled Template Debugging in Project Properties
fr: Modèle de débogage activé dans les propriétés du projet

source: configured unit testing for Django
fr: configuré les tests unitaires pour Django

source: Django Configuration Complete
fr: Configuration Django complète

source: The project file has been configured for Django.
fr: Le fichier projet a été configuré pour Django.

source: Configure Project for Django
fr: Configurer le projet pour Django

source: Could not find manage.py and/or settings.py in the project
fr: N'a pas pu trouvé manage.py et/ou settings.py dans le projet

source: Start a new application within the current Django project and add it to the INSTALLED_APPS list in the project's settings.py file.
fr: Lance une nouvelle application dans le projet Django courant et l'ajoute à la liste INSTALLED_APPS dans le fichier projet settings.py.

source: Failed to Start App
fr: Échec du démarrage de l'application

source: The Django app could not be created: %s
fr: L'application Django n'a pas pu être créée : %s

source: The command %s failed with error code %i and output: %s %s
fr: La commande %s a échouée avec le code d'erreur %i et la sortie suivante : %s %s

source: Created Django app %s in %s
fr: Application Django %s créée dans %s

source: Unable to read %s to update INSTALLED_APPS
fr: Incapable de lire %s pour mettre a jour INSTALLED_APPS

source: Unable to write %s to update INSTALLED_APPS
fr: Incapable d'écrire %s pour mettre a jour INSTALLED_APPS

source: Added %s to INSTALLED_APPS in %s
fr: %s ajouté à INSTALLED_APPS dans %s

source: The App was Created
fr: L'application a été créée

source: The application was created.
fr: L'application a été créée

source: Start New Django Application
fr: Démarrer une nouvelle application Django

source: Could not migrate db: %s
fr: N’a pas pu migrer la bd : %s

source: Could not sync the database: Sub-process timed out
fr: N'a pas pu synchroniser la base de données : le délai du sous-processus a expiré

source: Could not migrate the database: Sub-process timed out
fr: N'a pas pu migrer la base de données : le délai du sous-processus a expiré

source: Could not sync the database: Sub-process failed with exit_status=%s, errno=%s
fr: N'a pas pu synchroniser la base de données : le sous-processus a échoué avec exit_status=%s, errno=%s

source: Could not migrate the database: Sub-process failed with exit_status=%s, errno=%s
fr: N'a pas pu migrer la base de données : le sous-processus a échoué avec exit_status=%s, errno=%s

source: Sync DB completed
fr: Sync DB complété

source: Sync DB completed with no errors or output
fr: Sync DB complété sans erreur si sortie

source: Migrate Database
fr: Migrer la base de données

source: Run manage.py unit tests in the Testing tool
fr: Lancer les tests unitaires de manage.py dans l'outil Tests

source: Run Unit Tests
fr: Lancer des tests unitaires

source: Failed to run Django unit tests
fr: Échec de lancement des tests unitaires Django

source: Could not run Django : %s
fr: N'a pas pu lancer Django : %s

source: Django Unit Tests
fr: Tests unitaires Django

source: Starting Django Unit Tests at %s:
fr: Démarrer des tests unitaires Django à %s :

source: Could not run Django unit tests: Sub-process timed out
fr: N'a pas pu lancer les tests unitaires Django : le délai du sous-processus a expiré

source: Could not run Django unit tests: Sub-process failed with exit_status=%s, errno=%s
fr: N'a pas pu lancer les tests unitaires Django : le sous-processus a échoué avec exit_status=%s, errno=%s

source: Django unit tests passed successfully
fr: Tests unitaires Django passés avec succès

source: Django unit tests passed successfully with no output
fr: Tests unitaires Django passés avec succès sans sortie

source: Failed to Generate SQL
fr: Échec de génération de SQL

source: Could not generate SQL: %s
fr: N'a pas pu générer de SQL : %s

source: Django SQL
fr: SQL Django

source: Failed to start sub-process
fr: Échec du lancement du sous-processus

source: Sub-process timed out
fr: Délai du sous-processus expiré

source: Could not generate SQL: %s
fr: N'a pas pu générer du SQL : %s

source: Generate SQL
fr: Générer du SQL

source: Django App Name
fr: Nom d'application Django

source: Could not migrate app: %s
fr: N’a pas pu migrer l’application : %s

source: Migrate App
fr: Migrer l’application

source: Failed to Show Migrations
fr: Échec pour afficher les migrations

source: Could not show migrations: %s
fr: N’a pas pu afficher les migrations : %s

source: Show Migrations
fr: Afficher les migrations

source: Failed to Validate
fr: Échec de validation

source: Could not validate: %s
fr: N'a pas pu valider : %s

source: Could Not Validate
fr: N'a pas pu valider

source: Could not validate: %s
fr: N'a pas pu valider : %s

source: Validate Succeeded
fr: Validation réussie

source: Validated with 0 errors found
fr: Validé avec 0 erreurs trouvées

source: Django Validate
fr: Validation Django

source: Show documentation for using Wing and Django together
fr: Afficher la documentation pour utiliser Wing et Django ensemble

source: Show Documentation
fr: Afficher la documentation

source: Restart Shell
fr: Redémarrer le Shell

source: Connect to signals on project so plugin can enable when appropriate
fr: Connecter aux signaux sur le projet ainsi le plugin peut être activé lorsque c'est approprié

source: Current project has changed
fr: Le projet courant a été modifié

source: Project contents have changed (given files were added or removed)
fr: Les contenus du projet ont changés (les fichiers donnés ont été ajoutés ou enlevés)

source: Avoid constant scanning of project during file discovery; we scan one second after the last project file update
fr: Éviter un scan constant du projet durant la découverte du fichier ; nous scandons une seconde après la mise à jour du dernier fichier projet

source: Try to find key Django project files in the project. Returns full path to manage.py and settings.py (or settings package) or (None, None) if not found.
fr: Essaie de trouver les fichiers projet Django clés dans le projet. Retourne le chemin complet à manage.py et settings.py (ou le package settings) ou (None, None) si non trouvé.

source: Get a list of the app directories in the current project. Returns a list of the full path to the app directory. The app name is os.path.basename() of each path.
fr: Obtient une liste des répertoires d'applications dans le projet courant. Retourne une liste du chemin complet vers le répertoire d'applications. Le nom de l'application est os.path.basename() de chaque chemin.

source: Try to detect if this is a Django project, based on its contents
fr: Essaie de détecter si c'est un projet Django, en fonction de ses contenus

source: Plugin activator for Django. Note this must call CAPIApplication.EnablePlugin() and return True to enable or False to disable initially
fr: Activateur de plugin pour Django. Noter qu'il doit appeler CAPIApplication.EnablePlugin() et retourner True pour permettre ou False pour désactiver initialement

source: Django Extensions
fr: Extensions Django
