Repository: SuperVirus/wing7-po-all
Catalog: PO/*/src_refactoring.po
Languages: fr

source: _Rename Symbol
fr: _Renommer le symbole

source: _Move Symbol
fr: _Déplacer le symbole

source: E_xtract Function / Method
fr: E_xtraire une fonction / méthode

source: _Introduce Variable
fr: _Introduire une variable

source: Select code to refactor in the editor and then use the Refactor menu
fr: Sélectionner le code à refactoriser dans l'éditeur puis utiliser le menu Refactoriser

source: Scan for Existing Names
fr: Scan pour les noms existants

source: Show Refactoring Documentation
fr: Afficher la documentation de Refactorisation

source: Name Already Exists
fr: Le nom existe déjà

source: Scan for existing names
fr: Scan pour les noms existants

source: _Cancel
fr: Annuler

source: _Name:
fr: _Nom :

source: _Toplevel Function
fr: _Fonction de haut-niveau

source: _Method
fr: Méthode

source: N_ested Function
fr: Fonction Imbriquée

source: E_xtract
fr: E_xtraire

source: _Revert
fr: _Revenir

source: Revert all changes?
fr: Revenir sur toutes les modifications ?

source: Other changes were made to files. Revert them all?
fr: D'autres modifications ont été apportées aux fichiers. Revenir sur toutes celles-ci ?

source: line %s
fr: ligne %s

source: lines %s through %s
fr: des lignes %s à %s

source: Extracting %s
fr: Extraction %s

source: Extract function / method
fr: Extraire une fonction / méthode

source: Introducing Variable for: %s
fr: Introduit une variable pour : %s

source: Introduce Variable
fr: Introduire une variable

source: Refresh
fr: Rafraîchir

source: Show Possible Uses
fr: Afficher les utilisations possibles

source: Show Unlikely Uses
fr: Afficher les utilisations improbables

source: Search Project Files
fr: Chercher dans les fichiers projets

source: Search for uses in all Python files in the project
fr: Rechercher les utilisations dans tous les fichiers Python dans le projet

source: Search Original File
fr: Chercher dans le fichier Original

source: Search for uses in the file where the symbol was selected
fr: Rechercher les utilisations dans le fichier où le symbole était sélectionné

source: Searching...
fr: En recherche...

source: New _Name:
fr: Nouveau _Nom :

source: _Rename Checked
fr: _Renommage vérifié

source: Revert
fr: Revenir

source: Rename in progress
fr: Renommage en cours

source: Renaming %s to %s
fr: Renomme %s en %s

source: Reverting renaming %s to %s
fr: Revenir sur le renommage de %s à %s

source: Rename
fr: Renommer

source: <module global scope>
fr: <portée du module global>

source: Destination File
fr: Fichier de Destination

source: _File:
fr: _Fichier :

source: _Scope:
fr: _Portée :

source: _Move & Update Checked
fr: _Déplacement & mise à jour vérifiés

source: in
fr: dans

source: moving %s to %s
fr: déplace %s vers %s

source: Move in progress
fr: Déplacement en cours

source: Reverting
fr: En train de revenir

source: Move
fr: Déplacer

source: Refactoring
fr: Refactorisation

source: Can't introduce variable because original expression is not valid
fr: Ne peut pas introduire de variable car l’expression originale n’est pas valide

source: class %s in %s
fr: classe %s dans %s

source: method %s of %s in %s
fr: méthode %s de %s dans %s

source: function %s in %s
fr: fonction %s dans %s
