Repository: SuperVirus/wing7-po-all
Catalog: PO/*/src_wingbase.po
Languages: de

source: Wild Card on File Name
de: Wildcard auf Dateiname

source: Mime Type
de: Mime-Typ

source: Wild Card on Directory Name
de: Wildcard auf Verzeichnisname

source: Invalid or empty filter %s spec pos=%i: '%s'
de: UngÃ¼ltiger oder leerer Filter %s spec pos=%i: '%s'

source: Bad mime type in filter %s spec pos=%i: '%s'
de: Fehlerhafter Mime-Typ in Filter %s spec pos=%i: '%s'

source: Unknown filter %s spec type pos=%i: '%s'
de: Unbekannter Filter %s spec type pos=%i: '%s'

source: Wing Project
de: Wing Projekt

source: Python Interface
de: Python-Schnittstelle

source: %s File
de: %s Datei

source: Unable to convert to unicode. Tried encodings: %s.
de: Konnte nicht zu Unicode konvertieren. Versuchte Kodierungen: %s.
