Repository: SuperVirus/wing7-po-all
Catalog: PO/*/src_wingide.po
Languages: ru

source: About Wing
ru: О программе Wing

source: Product
ru: Продукт

source: Version
ru: Версия

source: Release Date
ru: Дата выпуска

source: Install Directory
ru: Каталог установки

source: Settings Directory
ru: Каталог настроек

source: Cache Directory
ru: Каталог кэша

source: OS Version
ru: Версия OS

source: Memory
ru: Память

source: Locale
ru: Языковой стандарт

source: GUI Toolkit
ru: GUI Набор инструментов

source: _Version
ru: _Версия

source: License Number
ru: Номер лицензии

source: Licensed Product
ru: Лицензионный продукт

source: License Type
ru: Тип лицензии

source: Activation Date
ru: Дата активации

source: License Term
ru: Срок действия лицензии

source: Customer Info
ru: Информация о клиенте

source: Perpetual License - Commercial Use
ru: Бессрочная лицензия-коммерческое использование

source: Perpetual License - Non-Commercial Use
ru: Бессрочная лицензия-некоммерческое использование

source: Perpetual License - Educational Use
ru: Бессрочная лицензия-использование в образовательных целях

source: Trial License - Evaluation Use Only
ru: Пробная лицензия - только для оценки

source: Annual License - Commercial Use
ru: Годовая лицензия - коммерческое использование

source: Annual License - Non-Commercial Use
ru: Годовая лицензия - некоммерческое использование

source: Free Annual License - Educational Use
ru: Бесплатная годовая лицензия - образовательное использование

source: Invalid License Type
ru: Недопустимый тип лицензии

source: %s (unknown)
ru: %s (неизвестно)

source: version
ru: версия

source: (missing)
ru: (отсутствует)

source: _License
ru: _Лицензия

source: _Credits
ru: _Благодарности

source: Close
ru: Закрыть

source: Cancel
ru: Отмена

source: Skipping update check -- done too recently
ru: Пропуск проверки обновления -- выполнен слишком недавно

source: Finding Updates
ru: Поиск обновлений

source: Submitting update request. Please wait:
ru: Отправка запроса на обновление. Пожалуйста, подождите:

source: Starting update check...
ru: Запуск проверки обновлений ...

source: Connecting to wingware.com
ru: Подключение к wingware.com

source: Network Error
ru: Ошибка сети

source: Unable to connect to wingware.com. Please check your network connection and try again.
ru: Не удалось подключиться к wingware.com. Проверьте подключение к сети и повторите попытку.

source: Waiting for Reply
ru: Ожидание ответа

source: Reading Reply
ru: Чтение ответа

source: Error Obtaining Updates
ru: Ошибка получения обновлений

source: An error was encountered parsing the updates list. This may be caused by a web proxy server, or transient network problem.
ru: Произошла ошибка при разборе списка обновлений. Возможно это связано с настройкой proxy или кратковременной сетевой проблемой.

source: There are no new updates available. Your copy of %s %s is up to date.
ru: Нет новых обновлений. Ваша копия %s %s является актуальной.

source: No Updates Available
ru: Нет доступных обновлений

source: Show Details
ru: Показать подробности

source: Support+Upgrades Expired
ru: Поддержка + обновления истек

source: Renew _Support+Upgrades
ru: Обновление _Поддержка + Обновления

source: Support+Upgrades Expiring Soon
ru: Поддержка + обновления, истекают в ближайшее время

source: Extend _Support+Upgrades
ru: Расширение _Поддержка + Модернизация

source: No Support+Upgrades Subscription
ru: Нет поддержки + подписки на обновления

source: Add _Support+Upgrades
ru: Добавить _Поддержка+Обновления

source: _Cancel
ru: _Отмена

source: _Automatically show this reminder
ru: _Автоматически показывать это напоминание

source: Note: %s
ru: Примечание: %s

source: Preparing Interface
ru: Подготовка интерфейса

source: Automatically check for updates
ru: Автоматическая проверка обновлений

source: Installing Updates
ru: Установка обновлений

source: _Restart Now
ru: _Перезагрузить сейчас

source: _Continue Working
ru: _Продолжить работу

source: Initializing script manager...
ru: Инициализация диспетчера сценариев ...

source: Could not store foreground lock timeout
ru: Не удалось сохранить тайм-аут блокировки переднего плана

source: WARNING: Could not restore the original foreground lock timeout used on Windows 98/ME and 2K/XP to control whether background applications can raise windows to the very front. This means that other applications may be able to raise windows unexpectedly until you log out or reboot.
ru: ПРЕДУПРЕЖДЕНИЕ: Истекло время ожидания блокировки переднего плана, в Windows 98/ME и 2K/XP, чтобы контролировать, могут ли фоновые приложения поднимать окна на верхний уровень. Это означает, что другие приложения могут неожиданно поднимать окна, пока вы не выйдете из системы или не перезагрузитесь.

source: Cannot find Python
ru: Не удается найти Python

source: A supported version of Python could not be found. If you have a recent Python, be sure you also have a recent version of Wing. If you do not have Python on your system, you will need to install it before most of Wing's features will function properly. If Python is already installed, use Project Properties in the Project menu to select the Python Executable to use.
ru: Не удалось найти поддерживаемую версию Python. Если у вас есть недавний Python, убедитесь, что у вас также есть последняя версия Wing. Если у вас нет Python в вашей системе, вам нужно будет установить его, прежде чем большинство функций Wing будут работать правильно. Если Python уже установлен, используйте Project Properties в меню Project, чтобы выбрать исполняемый файл Python.

source: A supported version of Python could not be found. If you have a recent Python, be sure you also have a recent version of Wing. If you do not have Python on your system, you will need to install it before most of Wing's features will function properly. If Python is already installed, use Configure Python in the Edit menu to select the Python Executable to use.
ru: Не удалось найти поддерживаемую версию Python. Если у вас есть недавний Python, убедитесь, что у вас также есть последняя версия Wing. Если у вас нет Python в вашей системе, вам нужно будет установить его, прежде чем большинство функций Wing будут работать правильно. Если Python уже установлен, используйте Configure Python в меню Edit, чтобы выбрать исполняемый файл Python для использования.

source: Starting application instance manager...
ru: Запуск диспетчера экземпляров приложения...

source: Checking autosaves...
ru: Проверка автосохранения...

source: Cannot execute unsaved file.
ru: Не удается выполнить несохраненный файл.

source: Cannot execute %s because it does not exist.
ru: Не удается выполнить% s, поскольку он не существует.

source: Cannot execute
ru: Не удается выполнить

source: Could not display %s
ru: Не удалось отобразить %s

source: Error = %s
ru: Ошибка = %s

source: Failed to display document viewer or web browser
ru: Не удалось отобразить средство просмотра документов или web browser

source: Could not display
ru: Не удалось отобразить

source: Bad viewer command
ru: Неверная команда просмотра

source: Timeout waiting for process exit
ru: Таймаут ожидания завершения процесса

source: Could not start process
ru: Не удалось запустить процесс

source: Process failed
ru: Ошибка процесса

source: Could not find in path
ru: Не удалось найти в path

source: Python webbrowser.open() failed
ru: Python webbrowser.open() ошибка

source: Could not launch document viewer for %s. Tried these:
ru: Не удалось запустить средство просмотра документов для %s. Попробовал эти:

source: %s (Error=%ld): %s
ru: %s (Ошибка=%ld): %s

source: Could not read autosave file: %s
ru: Не удалось прочитать файл автосохранения: %s

source: Could restore project auto-save file: %s
ru: Доступно восстановление файла автоматического сохранения проекта:% s

source: Recover Unsaved Changes?
ru: Восстановить несохраненные изменения?

source: Wing has found changes that were not saved during your last session. Please select the files you wish to recover:
ru: Wing обнаружил изменения, которые не были сохранены во время вашей последней сессии. Выберите файлы, которые вы хотите восстановить:

source: Discard Unsaved Changes
ru: Отмена несохраненных изменений

source: Re-select Files
ru: Повторный выбор файлов

source: Discard Unsaved Changes?
ru: Отменить несохраненные изменения?

source: Are you sure you want to discard all unsaved changes?
ru: Вы уверены, что хотите сбросить все несохраненные изменения?

source: Discard Some Unsaved Changes?
ru: Отменить некоторые несохраненные изменения?

source: Are you sure you want to discard the unsaved changes in the files you did not select?
ru: Вы уверены, что хотите сбросить несохраненные изменения в файлах, которые Вы не выбрали?

source: Restore Selected Files
ru: Восстановить выбранные файлы

source: Do not Restore
ru: Не восстанавливать

source: Opening specified project...
ru: Открытие указанного проекта...

source: Warning: More than one project specified on command line. Only the last one was opened.
ru: Предупреждение: В командной строке указано несколько проектов. Только последний был открыт.

source: Opening recent project...
ru: Открытие недавнего проекта...

source: Preparing workspace...
ru: Подготовка рабочего пространства...

source: Opening default project...
ru: Открытие проекта по умолчанию...

source: Displaying windows...
ru: Отображение окон...

source: Opening files...
ru: Открытие файлов...

source: No License::Failed to deactivate: No license is active.
ru: Нет лицензии::не удалось деактивировать: лицензия не активна.

source: Cannot Deactivate Trial::Wing cannot deactivate a trial license. Each installation uses a unique trial license. If you need more time on your trial, please email the license number %s to support@wingware.com.
ru: Не удается деактивировать пробную версию:: Wing не может деактивировать пробную лицензию. Каждая установка использует уникальную пробную лицензию. Если вам нужно больше времени на пробную версию, пожалуйста, напишите Номер лицензии %s к support@wingware.com.

source: Failed to Deactivate::Failed to deactivate the license %s. Please check permissions on file %s
ru: Не удалось деактивировать::Не удалось отключить лицензию %s. Проверьте разрешения на файл %s

source: Failed to Deactivate::Failed to deactivate the license %s: Unknown error.
ru: Не удалось деактивировать::Не удалось отключить лицензию %s: Неизвестная ошибка.

source: Deactivate License and Quit?
ru: Отключить лицензию и выйти?

source: Are you sure you want to deactivate and remove license %s and quit Wing?
ru: Вы действительно хотите деактивировать и удалить лицензию %s и выйти из Wing?

source: Deactivate and Quit
ru: Отключение и выход из программы

source: Scanned %i Python installations
ru: Сканированные %i установки Python

source: Proxy Server Configuration
ru: Конфигурация прокси-сервера

source: Unable to connect to wingware.com. Please check your network connection and try again. You may need to manually configure proxy settings if you are using an http proxy and Wing is not picking up the settings automatically.
ru: Не удается подключиться к wingware.com. Проверьте сетевое подключение и повторите попытку. Если вы используете http прокси-сервер, вам может потребоваться вручную настроить параметры прокси-сервера, и Wing не будет автоматически выбирать параметры.

source: Configure Proxy...
ru: Настройка Proxy...

source: Please quit Wing before logging out or shutting down your system. This ensures that all your changes will be saved to disk.
ru: Пожалуйста, закройте Wing перед выходом из системы или выключением системы. Это гарантирует, что все ваши изменения будут сохранены на диск.

source: Please quit Wing
ru: Пожалуйста, закройте Wing

source: Some remotely stored files were not saved. Please check Wing before logging out to make sure that all your remotely stored files have been saved successfully.
ru: Некоторые удаленные файлы не были сохранены. Перед тем, как выйти из системы, убедитесь, что все ваши удаленные файлы успешно сохранены.
