Repository: SuperVirus/wing7-po-all
Catalog: PO/*/src_pref.po
Languages: de

source: Display Language
de: Anzeigesprache

source: Color Palette
de: Farbpalette

source: Enable Tooltips
de: Werkzeug-Hinweise aktivieren

source: Show Editor Tabs
de: Editor-Reiter anzeigen

source: Show Toolbar
de: Werkzeugleiste anzeigen

source: Toolbar Size
de: Größe der Werkzeugleiste

source: Toolbar Style
de: Stil der Werkzeugleiste

source: Auto-save Perspectives
de: Perspektiven automatisch sichern

source: Display Font/Size
de: Schriftart/-größe der Anzeige

source: Editor Font/Size
de: Editor Schriftart/-größe

source: Personality
de: Individualität

source: Tab Key Action
de: Aktion der Tab-Taste

source: Alt Key
de: Alt-Taste

source: Custom Key Bindings
de: Benutzerdefinierte Tastaturbefehle

source: Typing Group Timeout
de: Zeitabschaltung für Buchstabenfolgen

source: VI Mode Ctrl-C/X/V
de: VI-Modus Strg-C/X/V

source: Show Splash Screen
de: Start-Bild anzeigen

source: When Launching Wing
de: Wenn Wing gestartet wird

source: Case Sensitive Sorting
de: Sortierung nach Groß- und Kleinschreibung

source: Always Use Full Path in Tooltips
de: In den Werkzeug-Tipps immer vollständigen Pfad verwenden

source: Max Error Log Size
de: Maximale Größe des Fehlerprotokolls

source: Key Map File
de: Datei der Tastaturbefehle

source: Auto-check for Product Updates
de: Automatisch nach Produkt-Updates suchen

source: Show Support+Upgrades Reminders
de: Support+Upgrades Erinnerungen anzeigen

source: Auto-Show Bug Report Dialog
de: Fehlerbericht-Dialog automatisch anzeigen

source: Title Style
de: Stil des Titels

source: Default Encoding
de: Standard-Kodierung

source: New File EOL
de: Zeilenende für neue Dateien

source: New File Extension
de: Dateizusatz für neue Dateien

source: Max Recent Items
de: Maximale Anzahl der letzten Dokumente

source: Maximum File Size (MB)
de: Maximale Datei-Größe (MB)

source: Extra File Types
de: Extra-Dateiarten

source: File Filters
de: Datei-Filter

source: External Check Freq
de: Externe Prüffrequenz

source: Reload when Unchanged
de: Neuladen wenn unverändert

source: Reload when Changed
de: Neuladen wenn geändert

source: File Display Commands
de: Befehle der Dateianzeige

source: Url Display Commands
de: Befehle der URL-Anzeige

source: Auto-reopen Last Project
de: Letztes Projekt automatisch wieder öffnen

source: Close Files with Project
de: Dateien mit Projekt schließen

source: Open Projects as Text
de: Projekte als Text öffnen

source: Show Line Numbers
de: Zeilennummern anzeigen

source: Show Whitespace
de: Leerraum anzeigen

source: Show EOL
de: Zeilenende anzeigen

source: Split Reuse Policy
de: Richtlinie für die Wiederverwendung von Teilungen

source: Background Color
de: Hintergrundfarbe

source: Block Comment Style
de: Stile des Blockkommentars

source: On Empty Selection
de: Bei leerer Auswahl

source: Middle Mouse Paste
de: Einfügen mit mittlerer Maustaste

source: Adjust Indent After Paste
de: Einrückung nach dem Einfügen anpassen

source: Syntax Formatting
de: Syntax-Formatierung

source: Highlight Builtins
de: Builtins hervorheben

source: Error Indicators
de: Fehler-Indikator

source: Indicator Style
de: Indikatorstil

source: Auto-Editing Enabled
de: Auto-Bearbeitung aktiviert

source: Auto-Close Characters
de: Zeichen automatisch schließen

source: Auto-Enter Invocation Args
de: Aufrufparameter automatisch eingeben

source: Apply Quotes to Selection
de: Anführungszeichen auf Auswahl anwenden

source: Apply (), [], and {} to Selection
de: (), [], und {} auf Auswahl anwenden

source: Auto-Enter Spaces
de: Leerzeichen automatisch eingeben

source: Auto-Space After Keywords
de: Auto-Leerzeichen nach Schlüsselwörten

source: Continue Comment or String on New Line
de: Kommentare oder Zeichenketten in neuer Zeile fortsetzen

source: Selection Color
de: Farbe der Auswahl

source: Caret Color
de: Textcursor Farbe

source: Caret Width
de: Caret-Breite

source: Caret Flash Rate (ms)
de: Textcursor Blinkrate (ms)

source: Caret Line Highlight
de: Textcursor Zeilenhervorhebung

source: Use Indent Analysis
de: Einrückungsanalyse verwenden

source: Default Tab Size
de: Standard-Tabgröße

source: Default Indent Size
de: Standard-Einrückungsgröße

source: Default Indent Style
de: Standard-Einrückungsstil

source: Auto Indent
de: Automatisch einrücken

source: Show Indent Guides
de: Einrückungslinien anzeigen

source: Show Python Indent Warning Dialog
de: Python-Einrückungswarnungs-Dialog anzeigen

source: Wrap Long Lines
de: Lange Zeilen umbrechen

source: Edge Markers
de: Kantenmarkierungen

source: Reformatting Wrap Column
de: Zeilenumbruch neu formatieren

source: Highlight Occurrences
de: Vorkommen hervorheben

source: Match Case
de: Groß- und Kleinschreibung beachten

source: Bookmark Color
de: Lesezeichen Farbe

source: Bookmark Style
de: Stil der Lesezeichen

source: Enable Folding
de: Falten aktivieren

source: Line Mode
de: Zeilenmodus

source: Foreground Color
de: Vordergrundfarbe

source: Auto-show Completer
de: Auto-Vervollständiger automatisch anzeigen

source: Completion Keys
de: Vervollständigungstasten

source: Auto-completer Height
de: Auto-Vervollständiger Höhe

source: Auto-complete Delay (sec)
de: Verzögerung des Auto-Vervollständigers (Sek.)

source: Auto-complete Timeout
de: Abschaltung des Auto-Vervollständigers

source: Completion Mode
de: Vervollständigungsmodus

source: Case Insensitive Matching
de: Groß- und Kleinschreibung ignorieren

source: Non-Python Completion
de: Nicht-Python Vervollständigung

source: Non-Python Word Size
de: Nicht-Python Wort-Größe

source: Orientation
de: Ausrichtung

source: Lock Scrolling
de: Scrollen sperren

source: Ignore White Space
de: Leerraum ignorieren

source: Diff Color
de: Diff Farbe

source: Document Font
de: Dokumentenschriftart

source: Use Default Foreground Colors
de: Standard Vordergrundfarben verwenden

source: Print Header Format
de: Zu druckendes Kopfzeilenformat

source: Print Header Font
de: Zu druckende Kopfzeilenschriftart

source: Print Footer Format
de: Zu druckendes Fußzeilenformat

source: Print Footer Font
de: Zu druckende Fußzeilenschriftart

source: Typing Suspend Timeout
de: Wartezeit für das Eintippen von Buchstabenfolgen

source: Max Cache Size (MB)
de: Maximale Cache-Größe (MB)

source: Max Memory Buffers
de: Maximaler Zwischenspeicher

source: Interface File Path
de: Dateipfad der Schnittstelle

source: Scrape Extension Modules
de: Erweiterungsmodule instanziieren

source: Scraping Helper Snippets
de: Instanziieren der Hilfsschnipsel

source: Advanced
de: Erweitert

source: Brace Highlighting
de: Hervorhebung von Klammern

source: Selection Policy
de: Auswahl-Richtlinie

source: Integer Display Mode
de: Anzeigemodus für Ganzzahlen

source: Run Marker Color
de: Farbe für Ausführen-Marker

source: Run Marker Alpha
de: Transparenz für Ausführen-Marker

source: Line Threshold
de: Zeilenschwelle

source: Indicate Project Files in Stack
de: Projektdateien im Stack kennzeichnen

source: Enable Multi-Process Debugging
de: Multi-Prozess Debuggen aktivieren

source: Switch to Stopped Processes
de: Zu gestoppten Prozessen wechseln

source: Maximum Process Count
de: Maximale Prozessanzahl

source: Report Exceptions
de: Exceptions berichten

source: Never Report
de: Nie anzeigen

source: Always Report
de: Immer anzeigen

source: Debug I/O Encoding
de: Debug I/O Kodierung

source: Shell Encoding
de: Shell Kodierung

source: Use External Console
de: Externe Konsole verwenden

source: External Console Waits on Exit
de: Externe Konsole wartet auf Beenden

source: External Consoles
de: Externe Konsolen

source: Huge List Threshold
de: Schwellwert für sehr große Listen

source: Huge String Threshold
de: Schwellwert für sehr große Strings

source: Show Data Warnings
de: Datenwarnungen anzeigen

source: Omit Types
de: Typen auslassen

source: Omit Names
de: Namen auslassen

source: Do Not Expand
de: Nicht erweitern

source: Accept Debug Connections
de: Debug-Verbindungen akzeptieren

source: Debug Internals Log File
de: Protokolldatei der Debug-Internals

source: Resolve Properties
de: Eigenschaften auflösen

source: Network Timeout
de: Netzwerkabschaltung

source: Ignore Unsynchronized Files
de: Nicht synchronisierte Dateien ignorieren

source: Use sys.stdin Wrapper
de: sys.stdin Wrapper verwenden

source: Shells Ignore Editor Modes
de: Shells ignorieren Editor-Modus

source: Force Win32 Window Raising
de: Win32 Fenster aufschlagen erzwingen

source: Default Watch Style
de: Standard-Beobachtungsstil

source: Common Attach Hosts
de: Gemeinsame Anhängen-Hosts

source: Allowed Hosts
de: Erlaubte Hosts

source: Location Map
de: Abbildung der Dateiposition

source: Search Path
de: Pfad suchen

source: Auto-Reload Scripts on Save
de: Skripte beim Speichern automatisch neu laden

source: Selection/Caret
de: Auswahl/Textcursor

source: Occurrences
de: Vorkommen

source: Indentation
de: Einrückung

source: Line Wrapping
de: Zeilenumbruch

source: Clipboard
de: Zwischenablage

source: Bookmarks
de: Lesezeichen

source: Folding
de: Falten

source: Auto-completion
de: Auto-Vervollständigung

source: Auto-editing
de: Auto-Bearbeitung

source: Diff/Merge
de: Vergleichen/Zusammenführen

source: Printing
de: Drucken

source: Context Menu
de: Kontextmenü

source: Toolbar
de: Werkzeugleiste

source: Fonts
de: Schriften

source: Keyboard
de: Tastatur

source: Perspectives
de: Perspektiven

source: Other
de: Andere

source: File Types
de: Dateiarten

source: Reloading
de: Neu laden

source: External Display
de: Externes anzeigen

source: Processes
de: Prozesse

source: Data Filters
de: Datenfilter

source: Diagnostics
de: Diagnose

source: User Interface
de: Benutzeroberfläche

source: Projects
de: Projekte

source: Files
de: Dateien

source: Source Analysis
de: Source-Analyse

source: Enable built-in version control
de: Eingebaute Versionsverwaltung aktivieren

source: Save files without prompting
de: Dateien ohne Nachfrae speichern

source: Enable diagnostic logging
de: Diagnoseprotokoll aktivieren

source: Version Control
de: Versionsverwaltung

source: IDE Extension Scripting
de: IDE-Erweiterungsskripting

source: Network
de: Netzwerk

source: Read preferences from %s
de: Einstellungen von %s lesen

source: Could not read preferences file %s
de: Einstellungsdatei %s konnte nicht gelesen werden

source: Serious error writing preferences file %s: File may be corrupted. Please report this problem to support@wingware.com
de: Schwerer Fehler beim Schreiben der Einstellungsdatei %s: Die Datei kann fehlerhaft sein. Bitte berichten Sie dieses Problem an support@wingware.com

source: Failed to write portions of preferences file to %s: Some preferences have been lost.
de: Das Schreiben von Teilen der Einstellungsdatei in %s ist fehlgeschlagen: Einige Einstellungen sind verloren gegangen.

source: Please report this problem to support@wingware.com
de: Bitte berichten Sie dieses Problem an support@wingware.com

source: Ca_tegory
de: Ka_tegorie

source: _Factory Defaults
de: _Standard-Konfiguration

source: _Cancel
de: _Abbrechen

source: _Apply
de: An_wenden

source: Preferences
de: Einstellungen

source: General
de: Allgemein

source: Really Clear Preferences?
de: Einstellungen wirklich löschen?

source: This command will clear your preferences file and restore the factory defaults. Are you sure you want to do this?
de: Dieser Befehl wird Ihre Einstellungsdatei löschen und die Standard-Konfiguration wiederherstellen. Möchten Sie dies wirklich vornehmen?

source: _Yes
de: _Ja

source: _No
de: _Nein
