Repository: SuperVirus/wing7-po-all
Catalog: PO/*/src_proj_commands.po
Languages: fr

source: These commands act on the project manager or on the current project, regardless of whether the project list has the keyboard focus.
fr: Ces commandes agissent sur le gestionnaire de projet ou sur le projet actuel, sans s'occuper si la liste du projet a le focus du clavier.

source: Utility method to get location of active editor.
fr: Méthode utilitaire pour obtenir l'emplacement de l'éditeur actif.

source: Finds a view to apply project commands to.
fr: Trouve une vue où appliquer les commandes du projet.

source: Raise the project manager window
fr: Faire resortir la fenêtre du gestionnaire de projet

source: Open the given project file, or prompt the user to select a file if the filename is not given.
fr: Ouvrir le fichier projet donné, ou demander à l'utilisateur de sélectionner un fichier si le nom de fichier n'est pas donné.

source: Open a project file from a remote host
fr: Ouvrir un fichier projet depuis un hôte distant

source: Save current project to a remote host
fr: Enregistrer le projet actuel sur un hôte distant

source: Remote URL Required
fr: URL distante requise

source: Cannot save to %s. The remote filename must be in form ssh://hostname/path/to/file
fr: N’a pas pu enregistrer à %s. Le nom de fichier distant doit être de la forme ssh://hostname/path/to/file

source: Close currently open project file
fr: Fermer le fichier projet actuellement ouvert

source: Save project file.
fr: Enregistrer le fichier projet.

source: Save project file under the given name, or prompt user for a name if the filename is not given.
fr: Enregistrer le fichier projet sous un nom donné, ou demander à l'utilisateur un nom si le nom de fichier n'est pas donné.

source: Add an existing file to the project.
fr: Ajouter un fichier existant au projet.

source: Add directory to project.
fr: Ajouter un répertoire au projet.

source: Add the frontmost currently open file to project
fr: Ajouter le fichier actuellement ouvert le plus en avant au projet

source: Remove directory from project.
fr: Enlever le répertoire du projet

source: Remove currently selected file or package from the project
fr: Enlever le fichier actuellement sélectionné ou le paquet du projet

source: Scan project directories for changes. If list of directories is not specified, currently selected directories are used.
fr: Scan des modifications des répertoires du projet. Si la liste des répertoires n'est pas précisée, les répertoires actuellement sélectionnés seront utilisés.

source: Show the currently selected file in the project view, if present. The selection may be the current editor, if it has focus, or files selected in other views.
fr: Afficher le fichier actuellement sélectionné dans la vue projet, si présent. La sélection peut être l'éditeur actuel, si il a le focus, ou les fichiers sélectionnés dans d'autres vues.

source: Show current file failed::Could not show the current file in the project tool -- the project view could not be displayed.
fr: Échec d'affichage du fichier actuel::N'a pas pu afficher le fichier actuel dans l'outil de projet -- la vue du projet n'a pas pu être affichée.

source: Show current file failed::Could not show the current file in the project tool -- There is no selected file.
fr: Échec d'affichage du fichier actuel::N'a pas pu afficher le fichier actuel dans l'outil de projet -- Il n'y a pas de fichier sélectionné.

source: Show current file failed::Could not show the current file in the project tool -- the file %s is not in the project
fr: Échec d'affichage du fichier actuel::N'a pas pu afficher le fichier actuel dans l'outil de projet -- le fichier %s n'est pas dans le projet

source: Set current editor file as the main debug entry point for this project
fr: Affecter le fichier courant de l'éditeur comme point d'entrée principal de débogage pour ce projet

source: Clear main debug entry point to nothing, so that debugging runs the file in the current editor by default
fr: Effacer le point d’entrée principal de débogage principal à rien, ainsi le débogage lance la fichier dans l’éditeur actuel par défaut

source: View or change project-wide properties
fr: Voir ou modifier les propriétés de l'ensemble du projet

source: View project properties for a particular file (current file if none is given)
fr: Voir les propriétés du projet pour un fichier particulier (le fichier actuel si none est donné)

source: Show the project manager's directory properties dialog
fr: Afficher la boite de dialogue des propriétés du répertoire du gestionnaire de projets

source: Show the effective Python version and path for the current configuration
fr: Affiche la version effective de Python et le chemin pour la configuration actuelle

source: Set selected file as the main debug file for this project
fr: Établir le fichier sélectionné comme le fichier de débogage principal pour ce projet

source: Open files currently selected in the project manager
fr: Ouvrir le(s) fichier(s) sélectionné(s) actuellement dans le gestionnaire de projets

source: Open file currently selected in the project manager
fr: Ouvrir le fichier sélectionné actuellement dans le gestionnaire de projets

source: Browse file currently selected in the project manager
fr: Parcourir le fichier sélectionné actuellement dans le gestionnaire de projets

source: Start debugging the file currently selected in the project manager
fr: Démarrer le débogage du fichier sélectionné actuellement dans le gestionnaire de projets

source: Execute the file currently selected in the project manager
fr: Exécuter le fichier sélectionné actuellement dans le gestionnaire de projets

source: View project as directory tree from project file
fr: Voir le projet comme une arborescence de répertoires depuis le fichier projet

source: View project as flattened directory tree from project file
fr: Voir le projet comme une arborescence apaltie depuis le fichier du projet

source: Commands that are available only when the project view has the keyboard focus.
fr: Commandes qui sont disponibles seulement quand la vue du du projet a le focus sur le clavier.

source: Rename the currently selected file or directory in the project view
fr: Renommer le fichier ou répertoire sélectionné actuellement dans la vue du projet

source: New name for the directory
fr: Nouveau nom pour le répertoire

source: New Directory Name
fr: Nouveau nom de répertoire

source: New name for the file
fr: Nouveau nom pour le fichier

source: New File Name
fr: Nouveau nom de fichier

source: Rename Selected Item in Project
fr: Renommer l’élément sélectionné dans Projet

source: Move the files and/or directories currently selected in the project view to the trash or recycling bin
fr: Déplacer les fichiers et/ou répertoires actuellement sélectionnés dans la vue du projet vers la corbeille

source: Search in file or directory currently selected in the project manager
fr: Chercher dans le fichier ou répertoire sélectionné actuellement dans le gestionnaire de projets
